# FilterToSelect Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FilterDialog..::..FilterToSelect Property
FilterDialog Class See Also
---
The filter element to be selected once Show is invoked.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public ElementId FilterToSelect { get; set; }
```

Visual Basic
---
```text
Public Property FilterToSelect As ElementId
	Get
	Set
```

Visual C++
---
```text
public:
property ElementId^ FilterToSelect {
	ElementId^ get ();
	void set (ElementId^ value);
}
```

# ### Field Value
The default is InvalidElementId, resulting in selecting the first available (if any) FilterElement.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: The supplied ElementId id is not of a FilterElement. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
FilterDialog Class
Autodesk.Revit.UI Namespace